Repository: elementary/settings-desktop
Catalog: po/extra/*.po
Languages: cs, es, pl, ru, sv, uk

source: Desktop Settings
cs: Nastavení desktopového prostředí
es: Configuración del Escritorio
pl: Ustawienia pulpitu
ru: Параметры рабочего стола
sv: Skrivbordsinställningar
uk: Налаштування стільниці

source: Configure the dock, hot corners, and change wallpaper
cs: Nastavení panelu, rohů a změna pozadí plochy
es: Configure el Dock, las esquinas activas y el fondo de escritorio
pl: Konfiguruj dok, gorące narożniki i zmień tło pulpitu
ru: Настройка дока, активных углов и обоев
sv: Ställ in dockan, aktiva hörn och byt bakgrundsbild
uk: Налаштування доку, дій кутів та зміна тла

source: New features:
cs: Nové funkce:
es: Nuevas características:
pl: Nowe funkcje:
ru: Новые возможности:
sv: Nya funktioner:
uk: Нові функції:

source: Other updates:
cs: Ostatní aktualizace:
es: Otras actualizaciones:
pl: Inne aktualizacje:
ru: Остальные обновления:
sv: Övriga uppdateringar:
uk: Інші оновлення:

source: Updated translations
cs: Aktualizovány překlady
es: Traducciones actualizadas
pl: Zaktualizowane tłumaczenia
ru: Обновлены переводы
sv: Uppdaterade översättningar
uk: Оновлені переклади

source: There is now an undo option after removing a wallpaper
es: Ahora existe una opción de deshacer después de quitar un fondo de escritorio
pl: Dodano możliwość cofnięcia po usunięciu tła pulpitu
ru: Появилась опция отмены после удаления обоев
uk: Відтепер є можливість скасувати вибір після вилучення тла

source: Wallpapers are now sorted with custom wallpapers first
es: Ahora los fondos de escritorio se ordenan colocando los fondos personalizados primero
pl: Tła pulpitu są teraz posortowane tak by niestandardowe tła pojawiały się najpierw
ru: Обои теперь сортируются с пользовательскими обоями в начале
uk: Зображення тла тепер впорядковуються починаючи від власних зображень

source: Fixes:
es: Correcciones:
pl: Poprawki:
ru: Исправления:
uk: Виправлення:

source: Wallpaper accent color follows system setting
es: El color de énfasis del fondo de escritorio ahora sigue la configuración de sistema
pl: Kolor akcentu tła pulpitu jest teraz zgodny z ustawieniami systemu
ru: Акцентный цвет в меню обоев теперь следует настройкам системы
uk: Основний колір тла відповідає налаштуванням системи

source: Set-wallpaper contract fails gracefully when run as sudo
es: El contrato para establecer el fondo de escritorio ahora falla correctamente si se usa «sudo»
pl: Kontrakt set-wallpaper nie psuje się gdy jest uruchomiony z sudo
ru: Контракт для установки обоев теперь выдаёт ошибку когда запущен от суперпользователя
uk: Set-wallpaper не правильно працював під час запуску як sudo

source: Wallpapers with the same name are distinguished
es: Ahora se distinguen los fondos de escritorio que tengan el mismo nombre
pl: Tła pulpitu z taką samą nazwą są teraz rozróżniane
ru: Обои с одинаковыми именами теперь различаются
uk: Розрізнення зображень тла з однаковими назвами

source: Switching styles with the keyboard cancels dark style scheduling
es: Ahora al cambiar estilos con el teclado se cancela el ajuste de horario del estilo oscuro
pl: Zmiana stylu przy użyciu klawiatury anuluje ustawienia automatycznego ciemnego stylu
ru: Изменение стиля системы с помощью клавиатуры отменяет расписание тёмного режима
uk: Перемикання стилів за допомогою клавіатури скасовувало планування темного стилю

source: Style dyslexia-friendly switch properly
es: El estilo apto para dislexia se cambia correctamente
pl: Przełącznik przyjazny dla dyslektyków ma teraz poprawny styl
ru: Правильная стилизация переключателя шрифта для людей с дислексией
uk: Правильне перемикання стилів для людей з дислексією

source: Set custom Terminal commands for each hotcorner
pl: Ustawianie spersonalizowanych poleceń w każdym z rogów Terminala
ru: Назначайте собственные команды Терминала для каждого активного угла
uk: Встановлюйте власні команди термінала для кожного гарячого кута

source: Redesigned Appearance and Multitasking views
pl: Przeprojektowano widoki Wyświetlanie oraz Wielozadaniowość
ru: Переработано оформление категорий «Внешний вид» и «Многозадачность»
uk: Перероблені подання Вигляд і Багатозадачність

source: Move Text settings to their own page
cs: Nastavení textu přesunuto na vlastní stránku
pl: Przeniesiono ustawienia tekstu na osobną stronę
ru: Настройки текста перемещены в свою собственную вкладку
uk: Налаштування тексту отримали власну сторінку

source: More granular settings for text scale
cs: Jemnější nastavení měřítka zobrazování textu
pl: Dokładniejsze opcje dla skalowania tekstu
ru: Настройки размера текста перемещены
uk: Докладніші налаштування масштабу тексту

source: Accent color and dark style options
cs: Předvolby pro barvu zvýraznění a tmavý vzhled
pl: Kolor akcentu i ustawienia ciemnego motywu
ru: Настройки цветового акцента и тёмного стиля
uk: Варіанти основного кольору та темний стиль

source: Dyslexia-friendly text preference to use the OpenDyslexia font system-wide
cs: Předvolba textu pro dyslektiky, pro použití písma OpenDyslexia napříč celým systémem
pl: Ustawienie tekstu przyjaznego dla dyslektyków przy użyciu czcionki OpenDyslexia w całym systemie
ru: Настройка удобного для людей с дислексией текста, при использовании общесистемного шрифта OpenDyslexia
uk: Налаштування зручного для людей з дислексією тексту за допомогою загальносистемного шрифту OpenDyslexia

source: Maximize and fullscreen workspace management options
cs: Předvolby pro správu pracovních ploch a maximalizace
pl: Opcje zarządzania maksymalizacji i pełnego ekranu
ru: Настройки управления рабочим столом в максимизированном и полноэкранном режимах
uk: Параметри керування максимізованими та повноекранними робочими просторами

source: Fix a freeze after opening Power settings
cs: Opraveno mrznutí po otevření nastavení napájení
pl: Naprawiono zawieszenie po otwarciu ustawień zasilania
ru: Исправлено зависание после открытия настроек питания
uk: Виправлено зависання після відкриття налаштувань живлення

source: Improved filter for image file types when importing
cs: Vylepšeno filtrování typů souborů s obrazovými daty při importu
pl: Usprawniono filtr dla plików obrazkowych podczas importowania
ru: Улучшен фильтр типов файлов изображения при импорте
uk: Вдосконалено фільтр типів файлів зображень під час імпортування

source: Visual updates
cs: Úpravy vzhledu
pl: Aktualizacje wizualne
ru: Обновления внешнего вида
uk: Оновлено зовнішній вигляд

source: Some options now appear in different tabs
cs: Některé volby se nyní objeví v různých kartách
pl: Niektóre opcje są teraz w innych kartach
ru: Некоторые опции теперь отображаются на разных вкладках
uk: Деякі параметри тепер розміщено на різних вкладках

source: Illustrate Dock icon sizes
cs: Ilustruje velikosti ikon na panelu
pl: Zilustrowano rozmiary ikon doka
ru: Иллюстрированные размеры пиктограмм в доке
uk: Ілюстровані розміри піктограм в доку

source: Fix system wallpapers being copied
cs: Oprava toho, že jsou systémové tapety plochy kopírovány
pl: Naprawiono kopiowanie systemowych tapet
ru: Исправлено копирование обоев системы
uk: Виправлено копіювання системного тла

source: Update search results
cs: Aktualizovat výsledky vyhledávání
pl: Zaktualizowano wyniki wyszukiwania
ru: Обновление результатов поиска
uk: Оновлення результатів пошуку

source: Fix issues with setting wallpapers on the Login and Lock screen
cs: Oprava problémů s nastavením pozadí na přihlašovací a zamykací obrazovce
pl: Naprawiono problemy z ustawianiem tapety na ekranie logowania i blokady ekranu
ru: Решены проблемы с настройкой обоев на экране входа и блокировки
uk: Розв'язано проблеми з налаштуванням тла на екрані входу та блокування

source: New Features:
es: Nuevas características:
sv: Nya funktioner:

source: Always Show Scrollbars setting
es: Se agregó una configuración de mostrar siempre las barras de desplazamiento
sv: Visa alltid inställning för rullningslister

source: Redundant labels have been cleaned up on the Appearance tab
es: Se limpiaron las etiquetas redundantes en la pestaña de Apariencia
sv: Överflödiga etiketter har rensats upp på fliken Utseende

source: The Dim Wallpaper setting has moved to the Appearance tab
es: El ajuste de atenuar el fondo del escritorio se ha movido a la pestaña de Apariencia
sv: Inställningen Dämpa bakgrundsbild har flyttats till fliken Utseende

source: The style selector now shows of a preview of your wallpaper as well as previewing the dim setting
es: Ahora se muestra una vista previa del escritorio normal y atenuado con el fondo de pantalla del usuario al seleccionar estilos
sv: Stilväljaren visar nu en förhandsgranskning av din bakgrundsbild samt en förhandsgranskning av dämpningsinställningen

source: Improved screen reader accessibility
es: Se mejoró la accesibilidad para los lectores de pantalla
sv: Förbättrad tillgänglighet för skärmläsare

source: Redesign Dock &amp; Panel settings with helpful description text
es: Se ha rediseñado la vista de configuración de «Panel y Dock» con un texto descriptivo útil
sv: Omarbeta Docka och panel-inställningarna med användbar beskrivningstext

source: Show or hide optional panel indicators
es: Ahora se puede mostrar u ocultar indicadores opcionales en el Panel
sv: Visa eller dölja valfria panelindikatorer

source: Fix translation of slideshow delay value and "Dim with dark style" label
es: Se corrigió el valor de espera de traslación en el carrusel de imágenes y la etiqueta de «Atenuar con estilo oscuro»
sv: Rätt översättning av värdet för fördröjning av bildspel och etiketten "Dämpa med mörk stil"

source: Fix an issue where wallpapers were not removed when closing System Settings immediately after
es: Se corrigió un error donde los fondos de escritorio no se quitaban al cerrar Configuración del Sistema inmediatamente después
sv: Åtgärdat ett problem där bakgrundsbilder inte togs bort när Systeminställningar stängdes omedelbart efter

source: Add an option to dim wallpapers when dark style is active
es: Se agregó una opción para atenuar fondos de escritorio cuando el estilo oscuro está activo
sv: Lägg till ett alternativ för att dämpa bakgrundsbilder när mörk stil är aktiv

source: Use a more vertical layout in the Text view
es: Se usa una disposición más vertical en la vista de Texto
sv: Använd en mer vertikal layout i textvyn

source: Update dock style
sv: Uppdatera dockstilen

source: Add setting for fullscreen hotcorners
sv: Lägg till inställning för aktiva hörn i helskärm

source: Add setting for scroll to switch workspaces
sv: Lägg till inställning för rullning för byte av arbetsyta
